<?php
/**
 * Created by PhpStorm.
 * User: ferdos.s
 * Date: 2/7/2017
 * Time: 12:13 PM
 */
class fill_tables_class
{
    function fill_job_requirement()
    {
        global $wpdb, $table_prefix;
        $insert_job_requirment_query = "
            INSERT INTO {$table_prefix}sho_job_requirment (id, center_id, degree_level, job_title, gender, study_field, qualify, date_, active) VALUES 
            (49, 600, 'M', 'ویزیتور', 1, 'حداقل دیپلم', 'حداکثر سن 28 سال - داشتن گواهینامه موتورسیکلت - فن بیان قوی و تضمین معتبر', '1391/08/17', 1)
            ,(58, 350, 'M', 'بازاریاب و فروشنده', 1, 'فوق دیپلم و لیسانس', 'حداکثر سن 30 سال - داشتن ضامن معتبر -  کارت پایان خدمت - کسانیکه دارای گواهینامه موتور سیکلت هستند در اولویت می باشند', '1390/03/28', 1)
            ,(90, 110, 'M', 'بازاریاب و فروشنده', 1, 'دیپلم و بالاتر', 'حداکثر سن 30 سال - علاقمند و دارای روابط عمومی بالا', '1390/08/01', 1)
            ,(132, 300, 'M', 'فروشنده', 1, 'دیپلم و بالاتر', 'ساکن تهران - حداکثر سن 30 سال -  پایان خدمت یا معافیت غیر پزشکی', '1391/07/22', 1)
            ,(176, 800, 'M', 'بازاریاب و فروشنده', 1, 'دیپلم و بالاتر', 'حداکثر سن 28 سال - داشتن تضمین معتبر - کارت پایان خدمت - داشتن سابقه کار مرتبط', '1392/04/09', 1)
            ,(178, 400, 'M', 'بازاریاب و فروشنده', 1, 'دیپلم به بالا', 'حداکثر سن 30 سال - داشتن تضمین معتبر - مسلط به کامپیوتر', '1392/04/22', 1)
            ,(180, 400, 'M', 'مامور پخش', 1, 'دیپلم به بالا', 'حداکثر سن 30 سال - داشتن تضمین معتبر', '1392/04/22', 1)
            ,(189, 10, 'M', 'کارگر بسته بندی ', 2, 'دیپلم', 'حداکثر سن 26 سال - مجرد', '1392/06/03', 1)
            ,(197, 801, 'M', 'بازاریاب و فروشنده', 1, 'دیپلم و بالاتر', 'داشتن کارت پایان خدمت یا معافیت غیر پزشکی', '1392/07/17', 1)
            ,(198, 801, 'M', 'مامور پخش', 1, 'دیپلم', 'داشتن کارت پایان خدمت یا معافیت غیر پزشکی', '1392/07/17', 1)
            ,(206, 970, 'M', 'بازاریاب و فروشنده', 1, 'لیسانس تمامی رشته ها و بالاتر', 'ساکن تبریز - حداکثر سن 30 سال - داشتن ضامن معتبر - دارای روابط عمومی بالا - داشتن کارت پایان خدمت یا معافیت غیر پزشکی - آشنا به کامپیوتر', '1392/08/18', 1)
            ,(207, 970, 'M', 'کارمند اداری', 3, 'لیسانس تمامی رشته ها و بالاتر', 'آشنا به Office و اینترنت - ساکن تبریز - حداکثر سن 30 سال - داشتن ضامن معتبر - داشتن کارت پایان خدمت یا معافیت غیر پزشکی', '1392/08/18', 1)
            ,(208, 800, 'M', 'کارمند اداری', 2, 'دیپلم یا فوق دیپلم', 'حداکثر سن 26 سال - مجرد - داشتن تضمین معتبر - آشنایی با کامپیوتر (Excel - Office)', '1392/10/08', 1)
            ,(217, 801, 'M', 'حسابدار', 3, 'لیسانس حسابداری', 'داشتن کارت پایان خدمت یا معافیت غیر پزشکی', '1392/11/25', 1)
            ,(218, 801, 'M', 'راننده پایه یک', 1, 'دیپلم', 'داشتن کارت پایان خدمت یا معافیت غیر پزشکی-گواهینامه پایه یک', '1392/11/25', 1)
            ,(219, 700, 'M', 'کارمند بازرگانی', 3, 'لیسانس حسابداری', '', '1393/01/17', 1)
            ,(220, 700, 'M', 'بازاریاب', 1, 'حداقل دیپلم', 'حداکثر 30 سال سن - دارا بودن سابقه کار', '1393/01/17', 1)
            ,(221, 700, 'M', 'کارگر انبار', 1, 'حداقل دیپلم', 'حداکثر 25 سال سن', '1393/01/17', 1)
            ,(222, 700, 'M', 'راننده پایه یک', 1, 'دیپلم', 'حداکثر 30 سال سن - دارا بودن مدارک کامل رانندگی', '1393/01/17', 1)
            ,(223, 800, 'M', 'مامور پخش', 1, 'دیپلم - فوق دیپلم', 'حداکثر سن 28 سال - داشتن تضمین معتبر - کار پایان خدمت(معافیت غیر پزشکی)', '1393/01/22', 1)
            ,(224, 800, 'M', 'راننده لیفتراک', 1, 'دیپلم', 'حداکثر سن 28 سال - داشتن تضمین معتبر - کار پایان خدمت(معافیت غیر پزشکی)', '1393/01/22', 1)
            ,(225, 800, 'M', 'کارگز انبار', 1, 'دیپلم', 'حداکثر سن 28 سال - داشتن تضمین معتبر - کار پایان خدمت(معافیت غیر پزشکی)', '1393/01/22', 1)
            ,(227, 970, 'M', 'کارمند صادرات', 1, 'لیسانس و بالاتر تمامی رشته ها', 'ساکن تبریز، مسلط به زبان انگلیسی-اینترنت و Office، حداکثر سن 30 سال، دارای روابط عمومی بالا، داشتن کارت پایان خدمت یا معافیت غیر پزشکی', '1393/01/25', 1)
            ,(238, 950, 'M', 'منشی تلفنی', 2, 'دیپلم به بالا', 'ساکن کرمان - حداکثر 30 سن سال - مسلط به برنامه های آفیس و توانایی سرعت تایپ بالا', '1393/05/25', 1)
            ,(239, 950, 'M', 'نگهبان', 1, 'دیپلم ', 'ساکن کرمان - حداکثر سن 30 سال - دارا بودن کارت پایان خدمت یا معافیت دائم (غیر پزشکی)', '1393/05/25', 1)
            ,(240, 950, 'M', 'بازاریاب و فروشنده (بازاریاب)', 1, 'دیپلم و بالاتر (با سابقه بازاریابی)', 'ساکن کرمان - حداکثر سن 30 - دارا بودن کارت پایان خدمت یا معافیت دائم (غیر پزشکی)', '1393/05/25', 1)
            ,(241, 950, 'M', 'کارگر انبار و مامور پخش', 1, 'دیپلم', 'ساکن کرمان - حداکثر سن 30 - دارا بودن کارت پایان خدمت یا معافیت دائم (غیر پزشکی)', '1393/05/25', 1)
            ,(242, 950, 'M', 'راننده پایه یک', 1, 'دیپلم', 'ساکن کرمان - حداکثر سن 30 - دارا بودن کارت پایان خدمت یا معافیت دائم (غیر پزشکی)', '1393/05/25', 1)
            ,(243, 950, 'M', 'کارمند حسابداری', 1, 'فوق دیپلم یا کارمند حسابداری', 'ساکن کرمان - حداکثر سن 30 سال - دارا بودن کارت پایان خدمت یا معافیت دائم(غیر پزشکی)', '1393/06/03', 1)
            ,(254, 400, 'M', 'راننده پایه یک', 1, '---', 'داشتن کارت پایان خدمت', '1394/06/07', 1)
            ,(263, 900, 'M', 'راننده', 1, 'دیپلم و بالاتر', 'داشتن گواهینامه پایه یکم و تضمین معتبر', '1395/01/21', 1)
            ,(262, 900, 'M', 'بازاریاب', 1, 'دیپلم و بالاتر', 'داشتن تضمین معتبر', '1395/01/21', 1)
            ";

        $wpdb->query($insert_job_requirment_query);
    }

    function fill_centers()
    {
        global $wpdb, $table_prefix;
        $insert_centers_query = "
            INSERT INTO {$table_prefix}sho_centers (id, hrms_id, center_name, center_desc) VALUES 
                (10,  10 ,' تبریز' ,   'دکتر نامي'),
    (100 , 100,' تبریز' ,  'کارخانه مرکزی'),
    (110 , 110,' اردبیل' ,  'دفتر پخش اردبیل'),
    (200 , 200,' سعید آباد','داداش برادر'),
    (250 , 250,' ارومیه' ,  'دفتر پخش ارومیه'),
    (300 , 300,' تهران' ,   'دفتر پخش تهران'),
    (350 , 350,' کرج' ,     'دفتر پخش کرج'),
    (400 , 400,' اصفهان' ,  'دفتر پخش اصفهان'),
    (450 , 450,' قم' ,      'دفتر پخش قم'),
    (500, 500,' رشت' ,     'دفتر پخش رشت'),
    (600, 600,' مشهد' ,    'دفتر پخش مشهد'),
    (601, 601,' اهواز' ,   'دفتر پخش اهواز'),
    (700, 700,' شيراز' ,   'دفتر پخش شيراز'),
    (750, 750,' زاهدان' ,  'دفتر پخش زاهدان'),
    (800, 800,' همدان' ,   'دفتر پخش همدان'),
    (801, 801,' کرمانشاه' ,'دفتر پخش کرمانشاه'),
    (900, 900,' ساري' ,    'دفتر پخش ساري'),
    (950, 950,' کرمان' ,   'دفتر پخش کرمان'),
    (970, 970,' تبریز' ,   'دفتر پخش تبريز')
                ";

        $wpdb->query($insert_centers_query);

    }

    function fill_degree()
    {
        global $wpdb, $table_prefix;
        $insert_degree_query = "
            INSERT INTO {$table_prefix}sho_degrees (id, hrms_id, degree_level, degree_name) VALUES 
             (10, 600, 'M', 'سیکل'        ),
             (11, 600, 'M', 'پیش دانشگاهی'),
             (12, 600, 'M', 'دیپلم'       ),
             (13, 600, 'M', 'فوق دیپلم'   ),
             (14, 600, 'M', 'لیسانس'      ),
             (15, 600, 'M', 'فوق لیسانس'  ),
             (16, 600, 'M', 'دکترا'       )
             
            
            ";

        $wpdb->query($insert_degree_query );
    }

    function fill_millitary()
    {
        global $wpdb, $table_prefix;
        $insert_millitary_query = "
            INSERT INTO {$table_prefix}sho_millitary (id, hrms_id, millitary_name) VALUES 
             (1, 1, 'دارای کارت پایان خدمت'),
             (2, 2, 'معافیت کفالت'),
             (3, 3, 'معافیت موارد خاص'),
             (4, 4, 'معافیت پزشکی'),
             (5, 5, 'معافیت خرید خدمت'),
             (6, 6, 'معافیت تحصیلی')
            ";

        $wpdb->query($insert_millitary_query );
    }
    function fill_gender()
    {
        global $wpdb, $table_prefix;
        $insert_query = "
            INSERT INTO {$table_prefix}sho_gender (id, hrms_id, gender_name) VALUES 
             (1, 1, 'مرد'),
             (2, 2, 'زن'),
             (3, 3, 'زن/مرد')
             ";

        $wpdb->query($insert_query  );
    }

    function fill_marriage()
    {
        global $wpdb, $table_prefix;
        $insert_query  = "
            INSERT INTO {$table_prefix}sho_marriage (id, hrms_id, marriage_name) VALUES 
             (1, 1, 'مجرد'),
             (2, 2, 'متاهل')
             ";

        $wpdb->query($insert_query  );
    }

    function fill_states()
    {
        global $wpdb, $table_prefix;
        $insert_query  = "
            INSERT INTO {$table_prefix}sho_states (id, state_name) VALUES
                    ('1','آذربایجان شرقی'),
                    ('2','آذربایجان غربی'),
				(3,'اردبيل'),
				(4,'اصفهان'),
				(5,'البرز'),
				(6,'ايلام'),
				(7,'بوشهر'),
				(8,'تهران'),
				(9,'چهارمحال و بختياري'),
				(10,'خراسان جنوبي'),
				(11,'خراسان رضوي'),
				(12,'خراسان شمالي'),
				(13,'خوزستان'),
				(14,'زنجان'),
				(15,'سمنان'),
				(16,'سيستان و بلوچستان'),
				(17,'فارس'),
				(18,'قزوين'),
				(19,'قم'),
				(20,'گلستان'),
				(21,'گيلان'),
				(22,'لرستان'),
				(23,'مازندران'),
				(24,'مرکزي'),
				(25,'هرمزگان'),
				(26,'همدان'),
				(27,'کردستان'),
				(28,'کرمان'),
				(29,'کرمانشاه'),
				(30,'کهگيلويه و بويراحمد'),
				(31,'يزد')
             ";
        $wpdb->query($insert_query  );
    }

    function fill_cities()
    {
        global $wpdb, $table_prefix;
        $insert_query  = "
            INSERT INTO {$table_prefix}sho_cities (id, city_name, state_id)
            VALUES
(2,'تبریز',1)
,(3,'مراغه',1)
,(4,'مرند',1)
,(5,'میانه',1)
,(6,'اهر',1)
,(7,'سراب',1)
,(8,'بناب',1)
,(9,'شبستر',1)
,(10,'آذرشهر',1)
,(11,'ملکان',1)
,(12,'اسکو',1)
,(13,'بستان‌آباد',1)
,(14,'هریس',1)
,(15,'عجب شیر',1)
,(16,'هشترود',1)
,(17,'جلفا',1)
,(18,'کلیبر',1)
,(19,'ورزقان',1)
,(20,'خداآفرین',1)
,(21,'چاراویماق',1)
,(22,'ارومیه',2)
,(23,'خوی',2)
,(24,'میاندوآب',2)
,(25,'بوکان',2)
,(26,'مهاباد',2)
,(27,'سلماس',2)
,(28,'پیرانشهر',2)
,(29,'نقده',2)
,(30,'سردشت',2)
,(31,'شاهین دژ',2)
,(32,'ماکو',2)
,(33,'تکاب',2)
,(34,'اشنویه',2)
,(35,'شوط',2)
,(36,'چالدران',2)
,(37,'چایپاره',2)
,(38,'پلدشت',2)
,(39,'اردبیل',3)
,(40,'پارس‌آباد',3)
,(41,'مشگین شهر',3)
,(42,'خلخال',3)
,(43,'گرمی',3)
,(44,'نمین',3)
,(45,'بیله سوار',3)
,(46,'کوثر',3)
,(47,'نیر',3)
,(48,'سرعین',3)
,(49,'اصفهان',4)
,(50,'کاشان',4)
,(51,'خمینی شهر',4)
,(52,'نجف‌آباد',4)
,(53,'فلاورجان',4)
,(54,'لنجان',4)
,(55,'شاهین شهر و میمه',4)
,(56,'شهرضا',4)
,(57,'مبارکه',4)
,(58,'برخوار',4)
,(59,'آران و بیدگل',4)
,(60,'گلپایگان',4)
,(61,'فریدن',4)
,(62,'تیران و کرون',4)
,(63,'سمیرم',4)
,(64,'نطنز',4)
,(65,'اردستان',4)
,(66,'فریدون‌شهر',4)
,(67,'نایین',4)
,(68,'دهاقان',4)
,(69,'چادگان',4)
,(70,'خوانسار',4)
,(71,'خور و بیابانک',4)
,(72,'کرج',5)
,(73,'ساوجبلاغ',5)
,(74,'نظرآباد',5)
,(75,'طالقان',5)
,(76,'ایلام',6)
,(77,'شیروان و چرداول',6)
,(78,'دهلران',6)
,(79,'دره شهر',6)
,(80,'ایوان',6)
,(81,'آبدانان',6)
,(82,'مهران',6)
,(83,'ملکشاهی',6)
,(84,'بوشهر',7)
,(85,'دشتستان',7)
,(86,'کنگان',7)
,(87,'گناوه',7)
,(88,'دشتی',7)
,(89,'تنگستان',7)
,(90,'دیر',7)
,(91,'جم',7)
,(92,'دیلم',7)
,(93,'تهران',8)
,(94,'شهریار',8)
,(95,'ورامین',8)
,(96,'بهارستان',8)
,(97,'اسلامشهر',8)
,(98,'ملارد',8)
,(99,'ری',8)
,(100, 'پاکدشت',8)
,(101, 'قدس',8)
,(102, 'رباط کریم',8)
,(103, 'دماوند',8)
,(104, 'پیشوا',8)
,(105, 'شمیرانات',8)
,(106, 'فیروزکوه',8)
,(107, 'شهرکرد',9)
,(108, 'لردگان',9)
,(109, 'بروجن',9)
,(110, 'فارسان',9)
,(111, 'کیار',9)
,(112, 'اردل',9)
,(113, 'کوهرنگ',9)
,(114, 'بیرجند',10)
,(115, 'قاینات',10)
,(116, 'طبس',10)
,(117, 'نهبندان',10)
,(118, 'درمیان',10)
,(119, 'فردوس',10)
,(120, 'سربیشه',10)
,(121, 'سرایان',10)
,(122, 'بشرویه',10)
,(123, 'مشهد',11)
,(124, 'نیشابور',11)
,(125, 'سبزوار',11)
,(126, 'تربت جام',11)
,(127, 'تربت حیدریه',11)
,(128, 'قوچان',11)
,(129, 'کاشمر',11)
,(130, 'چناران',11)
,(131, 'خواف',11)
,(132, 'تایباد',11)
,(133, 'فریمان',11)
,(134, 'سرخس',11)
,(135, 'گناباد',11)
,(136, 'درگز',11)
,(137, 'بردسکن',11)
,(138, 'زاوه',11)
,(139, 'رشتخوار',11)
,(140, 'بینالود',11)
,(141, 'جوین',11)
,(142, 'باخرز',11)
,(143, 'خلیل‌آباد',11)
,(144, 'مه‌ولات',11)
,(145, 'جغتای',11)
,(146, 'تخت جلگه',11)
,(147, 'کلات',11)
,(148, 'خوشاب',11)
,(149, 'بجستان',11)
,(150, 'بجنورد',12)
,(151, 'شیروان',12)
,(152, 'اسفراین',12)
,(153, 'مانه و سملقان',12)
,(154, 'فاروج',12)
,(155, 'جاجرم',12)
,(156, 'گرمه',12)
,(157, 'اهواز',13)
,(158, 'دزفول',13)
,(159, 'بندر ماهشهر',13)
,(160, 'آبادان',13)
,(161, 'ایذه',13)
,(162, 'شوش',13)
,(163, 'شوشتر',13)
,(164, 'بهبهان',13)
,(165, 'اندیمشک',13)
,(166, 'خرمشهر',13)
,(167, 'شادگان',13)
,(168, 'مسجدسلیمان',13)
,(169, 'باغ ملک',13)
,(170, 'رامهرمز',13)
,(171, 'دشت آزادگان',13)
,(172, 'امیدیه',13)
,(173, 'باوی',13)
,(174, 'گتوند',13)
,(175, 'اندیکا',13)
,(176, 'رامشیر',13)
,(177, 'هندیجان',13)
,(178, 'لالی',13)
,(179, 'هویزه',13)
,(180, 'هفتگل',13)
,(181, 'زنجان',14)
,(182, 'خدابنده',14)
,(183, 'ابهر',14)
,(184, 'خرمدره',14)
,(185, 'طارم',14)
,(186, 'ماهنشان',14)
,(187, 'ایجرود',14)
,(188, 'شاهرود',15)
,(189, 'سمنان',15)
,(190, 'دامغان',15)
,(191, 'گرمسار',15)
,(192, 'مهدی‌شهر',15)
,(193, 'زاهدان',16)
,(194, 'چاه‌بهار',16)
,(195, 'زابل',16)
,(196, 'ایرانشهر',16)
,(197, 'نیک شهر',16)
,(198, 'سراوان',16)
,(199, 'سرباز',16)
,(200, 'خاش',16)
,(201, 'کنارک',16)
,(202, 'زهک',16)
,(203, 'سیب و سوران',16)
,(204, 'هیرمند',16)
,(205, 'دلگان',16)
,(206, 'مهرستان',16)
,(207, 'شیراز',17)
,(208, 'مرودشت',17)
,(209, 'کازرون',17)
,(210, 'لارستان',17)
,(211, 'جهرم',17)
,(212, 'فسا',17)
,(213, 'داراب',17)
,(214, 'فیروزآباد',17)
,(215, 'ممسنی',17)
,(216, 'نی ریز',17)
,(217, 'آباده',17)
,(218, 'اقلید',17)
,(219, 'سپیدان',17)
,(220, 'لامرد',17)
,(221, 'کوار',17)
,(222, 'زرین دشت',17)
,(223, 'استهبان',17)
,(224, 'قیروکارزین',17)
,(225, 'خرامه',17)
,(226, 'مهر',17)
,(227, 'خرم بید',17)
,(228, 'بوانات',17)
,(229, 'گراش',17)
,(230, 'رستم',17)
,(231, 'فراشبند',17)
,(232, 'ارسنجان',17)
,(233, 'خنج',17)
,(234, 'سروستان',17)
,(235, 'پاسارگاد',17)
,(236, 'قزوین',18)
,(237, 'البرز',18)
,(238, 'تاکستان',18)
,(239, 'بویین‌زهرا',18)
,(240, 'آبیک',18)
,(241, 'قم',19)
,(242, 'گرگان',20)
,(243, 'گنبد کاووس',20)
,(244, 'علی‌آباد',20)
,(245, 'آق قلا',20)
,(246, 'کلاله',20)
,(247, 'آزادشهر',20)
,(248, 'رامیان',20)
,(249, 'مینودشت',20)
,(250, 'ترکمن',20)
,(251, 'کردکوی',20)
,(252, 'گمیشان',20)
,(253, 'گالیکش',20)
,(254, 'مراوه تپه',20)
,(255, 'بندر گز',20)
,(256, 'رشت',21)
,(257, 'تالش',21)
,(258, 'لاهیجان',21)
,(259, 'رودسر',21)
,(260, 'بندر انزلی',21)
,(261, 'لنگرود',21)
,(262, 'صومعه سرا',21)
,(263, 'آستانه اشرفیه',21)
,(264, 'رودبار',21)
,(265, 'فومن',21)
,(266, 'آستارا',21)
,(267, 'رضوانشهر',21)
,(268, 'شفت',21)
,(269, 'ماسال',21)
,(270, 'سیاهکل',21)
,(271, 'املش',21)
,(272, 'خرم‌آباد',22)
,(273, 'بروجرد',22)
,(274, 'کوهدشت',22)
,(275, 'دورود',22)
,(276, 'دلفان',22)
,(277, 'الیگودرز',22)
,(278, 'پلدختر',22)
,(279, 'سلسله',22)
,(280, 'ازنا',22)
,(281, 'دوره',22)
,(282, 'بابل',23)
,(283, 'ساری',23)
,(284, 'آمل',23)
,(285, 'قائم‌شهر',23)
,(286, 'بهشهر',23)
,(287, 'تنکابن',23)
,(288, 'نوشهر',23)
,(289, 'بابلسر',23)
,(290, 'چالوس',23)
,(291, 'نکا',23)
,(292, 'نور',23)
,(293, 'محمودآباد',23)
,(294, 'جویبار',23)
,(295, 'رامسر',23)
,(296, 'سوادکوه',23)
,(297, 'فریدونکنار',23)
,(298, 'میاندرود',23)
,(299, 'عباس آباد',23)
,(300, 'گلوگاه',23)
,(301, 'اراک',24)
,(302, 'ساوه',24)
,(303, 'شازند',24)
,(304, 'خمین',24)
,(305, 'خنداب',24)
,(306, 'زرندیه',24)
,(307, 'محلات',24)
,(308, 'دلیجان',24)
,(309, 'کمیجان',24)
,(310, 'فراهان',24)
,(311, 'تفرش',24)
,(312, 'آشتیان',24)
,(313, 'بندرعباس',25)
,(314, 'میناب',25)
,(315, 'بندر لنگه',25)
,(316, 'رودان',25)
,(317, 'قشم',25)
,(318, 'بستک',25)
,(319, 'حاجی‌آباد',25)
,(320, 'خمیر',25)
,(321, 'جاسک',25)
,(322, 'سیریک',25)
,(323, 'پارسیان',25)
,(324, 'بشاگرد',25)
,(325, 'ابوموسی',25)
,(326, 'همدان',26)
,(327, 'ملایر',26)
,(328, 'نهاوند',26)
,(329, 'کبودرآهنگ',26)
,(330, 'بهار',26)
,(331, 'رزن',26)
,(332, 'اسدآباد',26)
,(333, 'تویسرکان',26)
,(334, 'فامنین',26)
,(335, 'سنندج',27)
,(336, 'سقز',27)
,(337, 'مریوان',27)
,(338, 'قروه',27)
,(339, 'بانه',27)
,(340, 'کامیاران',27)
,(341, 'بیجار',27)
,(342, 'دیواندره',27)
,(343, 'دهگلان',27)
,(344, 'سروآباد',27)
,(345, 'کرمان',28)
,(346, 'رفسنجان',28)
,(347, 'جیرفت',28)
,(348, 'سیرجان',28)
,(349, 'بم',28)
,(350, 'زرند',28)
,(351, 'رودبار جنوب',28)
,(352, 'شهربابک',28)
,(353, 'کهنوج',28)
,(354, 'عنبرآباد',28)
,(355, 'قلعه گنج',28)
,(356, 'بافت',28)
,(357, 'بردسیر',28)
,(358, 'فهرج',28)
,(359, 'ریگان',28)
,(360, 'منوجان',28)
,(361, 'نرماشیر',28)
,(362, 'ارزوئیه',28)
,(363, 'راور',28)
,(364, 'انار',28)
,(365, 'فاریاب',28)
,(366, 'رابر',28)
,(367, 'کوهبنان',28)
,(368, 'کرمانشاه',29)
,(369, 'اسلام‌آباد غرب',29)
,(370, 'سنقر',29)
,(371, 'هرسین',29)
,(372, 'سرپل ذهاب',29)
,(373, 'کنگاور',29)
,(374, 'صحنه',29)
,(375, 'جوانرود',29)
,(376, 'گیلانغرب',29)
,(377, 'پاوه',29)
,(378, 'روانسر',29)
,(379, 'دالاهو',29)
,(380, 'ثلاث باباجانی',29)
,(381, 'قصرشیرین',29)
,(382, 'یاسوج',30)
,(383, 'دهدشت',30)
,(384, 'گچساران',30)
,(385, 'دنا',30)
,(386, 'بهمئی',30)
,(387, 'چرام',30)
,(388, 'باشت',30)
,(389, 'یزد',31)
,(390, 'میبد',31)
,(391, 'اردکان',31)
,(392, 'ابرکوه',31)
,(393, 'تفت',31)
,(394, 'مهریز',31)
,(395, 'بافق',31)
,(396, 'خاتم',31)
,(397, 'صدوق',31)
,(398, 'بهاباد',31)
     ";
    $wpdb->query($insert_query  );
}
}
